{"data":{"wordPressPost":{"title":"Reconnect Earth Supports Youth Mobilizing for Climate Action&#8211;Join Us!","content":"<p><img class=\" size-full wp-image-105 alignleft\" src=\"https://reconnectearth.local/app/uploads/2018/07/unnamed.png\" alt=\"unnamed\" width=\"240\" height=\"240\" srcset=\"https://reconnectearth.local/app/uploads/2018/07/unnamed.png 240w, https://reconnectearth.local/app/uploads/2018/07/unnamed-150x150.png 150w\" sizes=\"(max-width: 240px) 100vw, 240px\" />Something big is happening this month: <strong>Saturday, July 21st and the days leading up to it will mark the biggest youth of color-led mobilization for climate action in U.S. history.</strong> The <a href=\"http://thisiszerohour.org/\">Zero Hour movement</a> was initiated by high school students in Seattle and has spread to become a nationwide uprising for just and equitable solutions to the climate crisis. Reconnect Earth is organizing to support this historic mobilization, and we want you to join us!</p>\n<p><strong><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSeUW-xEzUsvlqm6PRK9lwd0mSwPT-4mZkHthfNgangM7nAgHA/viewform?usp=sf_link\">RSVP to participate in the youth-led Zero Hour movement with Reconnect Earth</a></strong></p>\n<p>Zero Hour will include a march of youth and their supporters on Washington, DC on July 21st, several sister marches in other major U.S. cities the same day, and other activities in the days leading up to that weekend. <strong>Reconnect Earth is working to coordinate carpools from Bellingham, WA to the Zero Hour march in Seattle,</strong> which begins at 9:00am at the Seattle Garfield Community Center Playfield. We&#8217;re also in the process of <strong>arranging a meeting with the office of Congressman Rick Larsen during the week of July 16-20th,</strong> where we&#8217;ll urge Rep. Larsen to support urgent action on climate change and the goals of the Zero Hour movement.</p>\n<p>Young people will be dealing with the effects of climate change longer than any other generation alive today, while the effects of climate disruption and pollution from fossil fuel industries disproportionately impact people of color. Despite this, youth of color have for much too long been excluded from high-profile discussions about climate policy. The organizers of the Zero Hour movement are working to change that, and Reconnect Earth has been in contact with them to make sure what we&#8217;re doing supports their efforts.</p>\n<p>Please help us support the Zero Hour movement by joining Reconnect Earth to march in Seattle, lobby in Bellingham, or both. <strong><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSeUW-xEzUsvlqm6PRK9lwd0mSwPT-4mZkHthfNgangM7nAgHA/viewform?usp=sf_link\">RSVP here to let us know how you can participate.</a></strong></p>\n","featuredMedia":null,"categories":[{"id":"1","title":"Uncategorized","path":"/category/uncategorized"}],"tags":[]}},"context":{}}