{"data":{"wordPressPost":{"title":"Fall Trips Are Open for Registration!","content":"<p><img class=\"  wp-image-137 alignleft\" src=\"https://reconnectearth.local/app/uploads/2018/09/img_20180506_152216244_hdr-2.jpg\" alt=\"IMG_20180506_152216244_HDR (2)\" width=\"381\" height=\"242\" srcset=\"https://reconnectearth.local/app/uploads/2018/09/img_20180506_152216244_hdr-2.jpg 748w, https://reconnectearth.local/app/uploads/2018/09/img_20180506_152216244_hdr-2-300x191.jpg 300w\" sizes=\"(max-width: 381px) 100vw, 381px\" />This fall, Reconnect Earth is excited to announce we&#8217;re organizing <a href=\"https://reconnectearth.org/fall/\">four trips</a> to some of the most beautiful places in and around Bellingham and Northwestern Washington. From weekend afternoon trips to places like the Chuckanut Mountains and Nooksack River, to a two-night Activist Training Retreat the last weekend in October, each of these events will give participants the chance to experience local ecosystems while activating our potential as agents of positive grassroots change.</p>\n<p>Reconnect Earth prioritizes giving emerging leaders tools to build stronger, longer-lasting environmental and social justice movements&#8211;and our experiential trips are central to achieving this goal. We interpret the term “environment” broadly, believing it encompasses human communities and that social justice and equity are an integral part of an ecologically viable future. We envision vibrant movements for a sustainable and socially just society, powered with grassroots organizing done by people who will be in the movement for the long term because they feel connected to diverse natural and human communities.</p>\n<p>So, want to hike through forests and along rivers, build grassroots organizing skills, and explore how you can make a difference on issues you care about in your community? <strong><a href=\"https://reconnectearth.org/fall/\">Learn more about our fall trips and sign up here!</a></strong></p>\n","featuredMedia":null,"categories":[{"id":"1","title":"Uncategorized","path":"/category/uncategorized"}],"tags":[]}},"context":{}}