{"data":{"wordPressPost":{"title":"A Conversation About Decolonizing","content":"\n<p>On March 10th Reconnect Earth led an event designed to spark conversations about decolonization and confronting the horrific history of colonialism in what is now Washington. This trip, called Decolonizing Bellingham&#8217;s Landscape, was part of our ongoing work to do environmental education in a new way that acknowledges and celebrates the history of Indigenous peoples on the landscape.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft is-resized\"><img src=\"https://reconnectearth.local/app/uploads/2019/03/p1120490-1.jpg\" alt=\"\" class=\"wp-image-401\" width=\"283\" height=\"377\" srcset=\"https://reconnectearth.local/app/uploads/2019/03/p1120490-1.jpg 2448w, https://reconnectearth.local/app/uploads/2019/03/p1120490-1-225x300.jpg 225w, https://reconnectearth.local/app/uploads/2019/03/p1120490-1-768x1024.jpg 768w\" sizes=\"(max-width: 283px) 100vw, 283px\" /><figcaption>Whatcom Creek</figcaption></figure></div>\n\n\n\n<p>Reconnect Earth begins all of our trips with a formal acknowledgement of the Indigenous peoples on whose land it takes place. However, the goal of this particular event was to go much further. We began in downtown Bellingham, walking down to Bellingham Bay below Maritime Heritage Park where we had a conversation about how Indigenous peoples like the Lummi have harvested food from the water since time immemorial. For countless generations the Bay has been a source of sustenance for the Lummi, who have managed their fishing practices in sustainable ways and continue to do so today.</p>\n\n\n\n<p>We next walked up into Maritime Heritage Park itself, a small urban park located where Whatcom Creek enters the bay. We stopped by a western red cedar and talked about the Lummi&#8217;s many uses of this tree, including everything from building cedar log canoes to making highly sophisticated fishing nets from cedar bark. This was followed by a conversation about cultural appropriation and when it is or is not respectful to use Indigenous art and imagery in public places (hint: the key is building authentic partnerships with Indigenous artists).</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignright is-resized\"><img src=\"https://reconnectearth.local/app/uploads/2019/03/p1120531-1.jpg\" alt=\"\" class=\"wp-image-399\" width=\"365\" height=\"273\" srcset=\"https://reconnectearth.local/app/uploads/2019/03/p1120531-1.jpg 3264w, https://reconnectearth.local/app/uploads/2019/03/p1120531-1-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2019/03/p1120531-1-768x576.jpg 768w, https://reconnectearth.local/app/uploads/2019/03/p1120531-1-1024x768.jpg 1024w\" sizes=\"(max-width: 365px) 100vw, 365px\" /><figcaption>Pausing in Maritime Heritage Park</figcaption></figure></div>\n\n\n\n<p>We continued to an overlook above the bay from which we could see Lummi and Orcas Islands. We discussed the long history of coastal peoples as expert seafarers. Prior to colonization the Lummi regularly made canoe journeys down the West Coast to the mouth of the Columbia River to trade with the villages there. The Haida, whose territory is in what is now northern British Columbia and southern Alaska, are known for making even longer canoe voyages as far south as California.</p>\n\n\n\n<p>Toward the conclusion of the trip we arrived at the bridge over Whatcom Creek itself. This is close to where the first permanent White settlers in what is now Bellingham built a sawmill in 1852. The Lummi treated them with hospitality, but just a few years later that kindness was repaid with dispossession. At the Treaty of Point Elliot in 1855, the Lummi and other Indigenous groups from throughout Northwest Washington were persuaded under duress to sign most of their territory over to White settlers. This is an injustice which has yet to be rectified.</p>\n\n\n\n<p>Our group made a timeline of the colonization which took place in Washington during the mid-1800s. We also talked about the long history of Indigenous resistance to colonizing forces. This includes the Puget Sound War of 1856, sparked by the colonial government&#8217;s duplicitous behavior in the wake of the Point Elliot Treaty signing. Today Indigenous people continue exercising and advocating for their right, guaranteed under the terms of the treaty, to fish in their accustomed territory. </p>\n\n\n\n<p>This Reconnect Earth trip was in no way intended as a substitute for learning directly from Indigenous people, who alone can speak authentically to their experience in what is now Northwestern Washington. Rather, the hope was to spark conversations that would lay the groundwork for deeper learning about the Indigenous presence on the landscape. To this end, we also talked about local opportunities to learn from Indigenous educators and community leaders in ways that don&#8217;t put undue demands on their time.</p>\n\n\n\n<p>You can read more about the philosophy behind this Reconnect Earth event <a href=\"https://reconnectearth.org/decolonize/\">here.</a> And stay tuned, because our work to continue engaging with these issues through education is certainly far from over.</p>\n","featuredMedia":null,"categories":[{"id":"1","title":"Uncategorized","path":"/category/uncategorized"}],"tags":[]}},"context":{}}