{"data":{"wordPressPost":{"title":"Finding Fall Salmon","content":"<p><img class=\"  wp-image-211 alignleft\" src=\"https://reconnectearth.local/app/uploads/2018/11/img_20181110_133450970.jpg\" alt=\"IMG_20181110_133450970\" width=\"367\" height=\"275\" srcset=\"https://reconnectearth.local/app/uploads/2018/11/img_20181110_133450970.jpg 769w, https://reconnectearth.local/app/uploads/2018/11/img_20181110_133450970-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2018/11/img_20181110_133450970-768x576.jpg 768w\" sizes=\"(max-width: 367px) 100vw, 367px\" />The annual migration of adult salmon up streams and rivers throughout the Northwest to their natal spawning grounds is one of the most incredible phenomena in this region. This past Saturday Reconnect Earth visited Arroyo Park in Bellingham to search for migrating salmon swimming up Chuckanut Creek. And we found them!</p>\n<p>About twelve trip participants, many Western Washington University students, met early Saturday afternoon at Arroyo Park and hiked a short way down the trail to the creek. The park protects healthy Douglas-firs, western red ceders, western hemlock, and other native plants that shelter Chuckanut Creek from erosion and too much direct sunlight. The result is good habitat for the large number of chum salmon who migrate up the creek every fall.</p>\n<p><img class=\"  wp-image-212 alignright\" src=\"https://reconnectearth.local/app/uploads/2018/11/img_20181110_152854561.jpg\" alt=\"IMG_20181110_152854561\" width=\"347\" height=\"260\" srcset=\"https://reconnectearth.local/app/uploads/2018/11/img_20181110_152854561.jpg 769w, https://reconnectearth.local/app/uploads/2018/11/img_20181110_152854561-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2018/11/img_20181110_152854561-768x576.jpg 768w\" sizes=\"(max-width: 347px) 100vw, 347px\" />We knew we&#8217;d be most likely to find salmon resting in the deeper pools, gathering their energy in preparation for a run up the shallower rapids or riffles. We began our search in an area with relatively shallow pools, and found a few salmon sheltering behind large rocks. With their splotchy coloration and green-and-tan banding on their sides, chum salmon are good at camouflaging among rocks and sticks. This species is the most abundant salmon in Washington, and is found in many streams throughout the Puget Sound watershed.</p>\n<p>As our group made its way upstream, we saw more salmon. We also stopped to admire birds like a Pacific wren flitting through the shrubbery along the path, and an American dipper bobbing up and down as it waded in the creek&#8217;s shallows. As we moved up the creek the sightings of salmon began to come more frequently.</p>\n<p><img class=\"alignleft size-full wp-image-213\" src=\"https://reconnectearth.local/app/uploads/2018/11/img_20181110_152910047-e1542146292773.jpg?w=386\" alt=\"IMG_20181110_152910047\" width=\"386\" height=\"284\" srcset=\"https://reconnectearth.local/app/uploads/2018/11/img_20181110_152910047-e1542146292773.jpg 643w, https://reconnectearth.local/app/uploads/2018/11/img_20181110_152910047-e1542146292773-300x220.jpg 300w\" sizes=\"(max-width: 386px) 100vw, 386px\" />Then, just downstream of the wooden bridge that spans Chuckanut Creek, we found them: a whole large group of salmon resting in one of the deepest pools we&#8217;d come across. There must have been more than a dozen, though sometimes they were hard to see beneath the creek&#8217;s moving surface. We got our best glimpses of salmon when they came briefly into the shallower water, sometimes because they were being chased by another fish who felt its personal space being invaded.</p>\n<p>After pausing by the big pool for a while we hiked a little farther upstream, then came back to the bridge for a conversation about salmon habitat needs and threats to their survival. We discussed what it takes for salmon to thrive: cool, clear streams free of turbidity; trees and other vegetation to shelter waterways and provide food for the insects juvenile salmon eat; and rivers unobstructed by impassable dams. The chum in Chuckanut Creek are a relatively healthy salmon run, but many other Northwest salmon are threatened by dams, deforestation, and large development projects in their habitat. All Northwest salmon are also potentially affected by climate change that reduces winter snowpack or otherwise leads to warmer, shallower streams.</p>\n<p><img class=\"  wp-image-214 alignright\" src=\"https://reconnectearth.local/app/uploads/2018/11/img_20181110_134403947-e1542146370542.jpg\" alt=\"IMG_20181110_134403947\" width=\"340\" height=\"275\" srcset=\"https://reconnectearth.local/app/uploads/2018/11/img_20181110_134403947-e1542146370542.jpg 715w, https://reconnectearth.local/app/uploads/2018/11/img_20181110_134403947-e1542146370542-300x242.jpg 300w\" sizes=\"(max-width: 340px) 100vw, 340px\" />We also talked about proactive steps to help salmon and the many other species&#8211;like orcas&#8211;that depend on them for food. In early 2019 the Washington State Legislature will be meeting, presenting the state with an opportunity to take action on climate change and clean energy, stream restoration, and other environmental priorities. Our group discussed ways to engage in the legislative session including organizing carpools from Bellingham to attend the annual Environmental Lobby Day event in Olympia.</p>\n<p>Finally, we took action to help salmon and the ecosystems they rely on by writing to local officials here in Bellingham. Before leaving Arroyo Park we got out pens, paper, and envelopes and wrote personalized letters to the new Bellingham Climate Action Task Force, expressing support for moving to 100% clean energy as rapidly as possible.</p>\n<p>In sum it was a good day looking for wild salmon in their natural habitat in Chuckanut Creek. Members of our group left having observed one of the great wildlife dramas of the Pacific Northwest, and determined to do what we could to help ensure a healthy future for sensitive salmon populations.</p>\n","featuredMedia":null,"categories":[{"id":"1","title":"Uncategorized","path":"/category/uncategorized"}],"tags":[]}},"context":{}}