{"data":{"wordPressPost":{"title":"Reconnect Earth Visits the Chuckanuts","content":"<p><img class=\"alignleft size-full wp-image-200\" src=\"https://reconnectearth.local/app/uploads/2018/10/img_20181021_154044071-e1540308739603.jpg?w=365\" alt=\"IMG_20181021_154044071\" width=\"365\" height=\"280\" srcset=\"https://reconnectearth.local/app/uploads/2018/10/img_20181021_154044071-e1540308739603.jpg 649w, https://reconnectearth.local/app/uploads/2018/10/img_20181021_154044071-e1540308739603-300x230.jpg 300w\" sizes=\"(max-width: 365px) 100vw, 365px\" />On Sunday, October 21st, a group of students from Western Washington University set out into the Chuckanut Mountains on Reconnect Earth&#8217;s first trip of the season. We started from the North Chuckanut Mountain Trailhead, just a short drive or bike ride from WWU and downtown Bellingham. It was a beautiful fall day with sunny weather and brilliant leaf colors on the numerous big-leafed maples, devil&#8217;s club, and other deciduous plant life.</p>\n<p>Our group followed the Hemlock Trail through stands of maples, Douglas-fir, and western red cedar. Other plant life included a diversity of fern species and an abundance of young western hemlocks in the understory. Now and then we heard the hoarse call of a raven and glimpsed its dark silhouette weaving among the treetops. We also paused for some boulder climbing:</p>\n<p><img class=\"alignnone  wp-image-201\" src=\"https://reconnectearth.local/app/uploads/2018/10/img_20181021_112825570_hdr.jpg\" alt=\"IMG_20181021_112825570_HDR\" width=\"367\" height=\"275\" srcset=\"https://reconnectearth.local/app/uploads/2018/10/img_20181021_112825570_hdr.jpg 835w, https://reconnectearth.local/app/uploads/2018/10/img_20181021_112825570_hdr-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2018/10/img_20181021_112825570_hdr-768x576.jpg 768w\" sizes=\"(max-width: 367px) 100vw, 367px\" /></p>\n<p>A couple miles into the hike we stopped at a trail junction for an activity meant to facilitate discussion about environmental justice and access to green space. Using a rope and sticks collected from the trail, we constructed a map of the Bellingham area large enough to stand and move about on. We then shifted our locations on the map in response to questions about the places where we live, buy food, go for enjoyment, and associate with nature, poverty, or danger. During the discussion participants brought up ways in which social forced concentrate less privileged and poverty-stricken communities away from large green spaces and close to sources of pollution.</p>\n<p><img class=\"  wp-image-202 alignleft\" src=\"https://reconnectearth.local/app/uploads/2018/10/img_20181021_134928069_hdr.jpg\" alt=\"IMG_20181021_134928069_HDR\" width=\"391\" height=\"293\" srcset=\"https://reconnectearth.local/app/uploads/2018/10/img_20181021_134928069_hdr.jpg 769w, https://reconnectearth.local/app/uploads/2018/10/img_20181021_134928069_hdr-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2018/10/img_20181021_134928069_hdr-768x576.jpg 768w\" sizes=\"(max-width: 391px) 100vw, 391px\" />After the activity we set out hiking again and reached Cedar Lake, a beautiful body of water whose nearly-still surface reflected the conifer trees growing around it. Cedar Lake is one of relatively few places in Northwest Washington where species of all four of our region&#8217;s dominant lowland conifers&#8211;Douglas-fir, hemlock, cedar, and spruce&#8211;are found growing together in one spot. We watched fish jump in the lake and ate lunch on the sunny shore, then walked the trail that circles the lake.</p>\n<p><img class=\"  wp-image-203 alignleft\" src=\"https://reconnectearth.local/app/uploads/2018/10/img_20181021_140647121.jpg\" alt=\"IMG_20181021_140647121\" width=\"343\" height=\"257\" srcset=\"https://reconnectearth.local/app/uploads/2018/10/img_20181021_140647121.jpg 769w, https://reconnectearth.local/app/uploads/2018/10/img_20181021_140647121-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2018/10/img_20181021_140647121-768x576.jpg 768w\" sizes=\"(max-width: 343px) 100vw, 343px\" />After taking time to explore the lake we began the hike back to the trailhead. Toward the end of our time in the woods we paused again to write letters to the City of Bellingham&#8217;s recently-established Climate Action Task Force. We discussed best practices for writing to elected officials or community leaders, and wrote in support of policies that will protect public health and the environment by moving Bellingham to 100% clean energy as rapidly as possible.</p>\n<p>In all it was a great day enjoying the forest while discussing important issues that affect our community and taking action for an important environmental cause.</p>\n<p><em>Want to join Reconnect Earth&#8217;s next fall trip? <a href=\"https://fs3.formsite.com/t1Jnpr/form3/index.html?1540310173059\">Look for migrating salmon with us on Saturday, November 10th.</a></em></p>\n","featuredMedia":null,"categories":[{"id":"1","title":"Uncategorized","path":"/category/uncategorized"}],"tags":[]}},"context":{}}