{"data":{"wordPressPost":{"title":"Report From the Field: Reconnect Earth&#8217;s First Summer Backpacking Trip!","content":"\n<div class=\"wp-block-image\"><figure class=\"alignleft is-resized\"><img src=\"https://reconnectearth.local/app/uploads/2019/07/p1120613.jpg\" alt=\"\" class=\"wp-image-485\" width=\"424\" height=\"317\" srcset=\"https://reconnectearth.local/app/uploads/2019/07/p1120613.jpg 3264w, https://reconnectearth.local/app/uploads/2019/07/p1120613-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2019/07/p1120613-768x576.jpg 768w, https://reconnectearth.local/app/uploads/2019/07/p1120613-1024x768.jpg 1024w\" sizes=\"(max-width: 424px) 100vw, 424px\" /></figure></div>\n\n\n\n<p>From June 24th &#8211; July 1st, nine young people from three Northwest states (Washington, Oregon, and Montana) and two Reconnect Earth trip leaders spent eight days together in Mount Baker-Snoqualmie National Forest, learning about and discussing environmental issues, social justice, and grassroots activism. Along the way the group experienced some of the most spectacular landscapes in the North Cascades, including subalpine meadows, old growth forest, and a hike to the base of a giant alpine glacier. </p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignright is-resized\"><img src=\"https://reconnectearth.local/app/uploads/2019/07/p1120593-1.jpg\" alt=\"\" class=\"wp-image-488\" width=\"348\" height=\"260\" srcset=\"https://reconnectearth.local/app/uploads/2019/07/p1120593-1.jpg 3264w, https://reconnectearth.local/app/uploads/2019/07/p1120593-1-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2019/07/p1120593-1-768x576.jpg 768w, https://reconnectearth.local/app/uploads/2019/07/p1120593-1-1024x768.jpg 1024w\" sizes=\"(max-width: 348px) 100vw, 348px\" /></figure></div>\n\n\n\n<p>We started the trip on June 24th at the Schriebers Meadow/Park Butte trailhead in Mount Baker-Snoqualmie Forest, hiking up the Park Butte Trail and reaching the beautiful Mazama Park Camp by late afternoon. Mazama Park is situated in a subalpine heather meadow, and it was here we pitched the camp that served as our base of operations for the first four days of the trip. The next few days included hikes to the historic fire lookout on Park Butte and to the bottom of Easton Glacier, as well as a rest day during which participants had a chance to recover from the physical activity while enjoying a day in Mazama Park. </p>\n\n\n\n<p>On our fifth day in the field we packed up camp and hiked to Elbow Lake, descending from the subalpine environment into an ancient old-growth forest dominated by massive hemlocks and cedar trees. Our group camped for two nights at Elbow Lake, with some participants joining a hike to the Nooksack River on the sixth day of the trip. We admired towering trees and a mature forest ecosystem featuring saprophytic plants, diverse fungi, and amphibians like the western toad. </p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft is-resized\"><img src=\"https://reconnectearth.local/app/uploads/2019/07/p1120648.jpg\" alt=\"\" class=\"wp-image-487\" width=\"324\" height=\"242\" srcset=\"https://reconnectearth.local/app/uploads/2019/07/p1120648.jpg 3264w, https://reconnectearth.local/app/uploads/2019/07/p1120648-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2019/07/p1120648-768x576.jpg 768w, https://reconnectearth.local/app/uploads/2019/07/p1120648-1024x768.jpg 1024w\" sizes=\"(max-width: 324px) 100vw, 324px\" /></figure></div>\n\n\n\n<p>Throughout the trip our group engaged in a activities and discussions designed to increase participants&#8217; knowledge of local natural history, environmental and social justice issues, and how to use grassroots organizing skills to create a better future. Topics included the history of Indigenous peoples and colonization in the Washington; workshops on campaign planning, grassroots lobbying, and nonviolent direct action; and exercises and facilitated discussions designed to help students explore their relationship with the natural world while harnessing their power as agents of positive change. </p>\n\n\n\n<p>On our last full day together we moved camp from Elbow Lake back to Mazama Park for one final night in the field before returning to the trail head the next morning. Finishing the trip and saying goodbye was a bittersweet process for everyone involved; our nine participants and two trip leaders formed bonds during our time in the North Cascades that will last well into the future. </p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignright is-resized\"><img src=\"https://reconnectearth.local/app/uploads/2019/07/unadjustednonraw_thumb_6b9_duncan.jpg\" alt=\"\" class=\"wp-image-491\" width=\"414\" height=\"309\" /></figure></div>\n\n\n\n<p>This first trip of the season is meant to be simply a first step for participants to engage in creating a more environmentally and socially just future&#8211;whether with Reconnect Earth, other organizations, or on their own. Going into the next school year Reconnect Earth will be providing support to young people organizing grassroots campaigns in their schools or communities. All alumni of our summer trips are invited to apply participate in this next phase of our work.</p>\n\n\n\n<p>Meanwhile, we&#8217;re getting ready for our next eight-day trip coming up in August. <strong><a href=\"https://fs3.formsite.com/t1Jnpr/eop3ammwbx/index.html\">Apply to join the trip here</a></strong> and participate in an eye-opening experience you&#8217;ll never forget!</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" /></figure>\n","featuredMedia":null,"categories":[{"id":"1","title":"Uncategorized","path":"/category/uncategorized"}],"tags":[]}},"context":{}}