{"data":{"wordPressPost":{"title":"Finding Marine Life on Bellingham Bay","content":"<p><img class=\"  wp-image-296 alignleft\" src=\"https://reconnectearth.local/app/uploads/2019/02/p1120505-2.jpg\" alt=\"P1120505 (2)\" width=\"353\" height=\"332\" srcset=\"https://reconnectearth.local/app/uploads/2019/02/p1120505-2.jpg 2604w, https://reconnectearth.local/app/uploads/2019/02/p1120505-2-300x282.jpg 300w, https://reconnectearth.local/app/uploads/2019/02/p1120505-2-768x722.jpg 768w, https://reconnectearth.local/app/uploads/2019/02/p1120505-2-1024x963.jpg 1024w\" sizes=\"(max-width: 353px) 100vw, 353px\" />Reconnect Earth visited Bellingham&#8217;s Boulevard Park this Saturday for a walk following the edge of Bellingham Bay, during which we searched for marine invertebrates, birds, and other sea life. Seven of us explored the water&#8217;s edge and followed the over-water walkway to Fairhaven, stopping to observe any organisms we found along the way.</p>\n<p>Bellingham Bay supports a variety of marine ecosystems including sandy beaches, rocking shores, and eel grass beds. When exploring the beaches we admired oysters and discussed the effects of ocean acidification; picked up clam, mussel, limpet, and crab shells; and examined washed-up kelp and eel grass. An examination of some submerged boulders revealed a small chiton&#8211;an ancient type of mollusk&#8211;clinging to a rock face just beneath the water&#8217;s surface.</p>\n<p><img class=\"  wp-image-297 alignright\" src=\"https://reconnectearth.local/app/uploads/2019/02/p1120506.jpg\" alt=\"P1120506\" width=\"359\" height=\"269\" srcset=\"https://reconnectearth.local/app/uploads/2019/02/p1120506.jpg 3264w, https://reconnectearth.local/app/uploads/2019/02/p1120506-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2019/02/p1120506-768x576.jpg 768w, https://reconnectearth.local/app/uploads/2019/02/p1120506-1024x768.jpg 1024w\" sizes=\"(max-width: 359px) 100vw, 359px\" />Farther out from shore a harbor seal poked its head above the waves, while a variety of birds hunted for food. With the help of a spotting scope we were able to identify surf scoters&#8211;a very distinctive-looking type of duck (pictured below) that uses its powerful beak to crack open marine mussel shells&#8211;far out on the bay. Slightly closer in a loon surfaced holding a small fish that it quickly swallowed. Common and Barrow&#8217;s goldeneye ducks came near enough to identify even with the naked eye. However, it took binoculars to make out the beautiful golden eyes that give these birds their name.</p>\n<p><img class=\" size-full wp-image-294 alignleft\" src=\"https://reconnectearth.local/app/uploads/2019/02/susc_tg_l.jpg\" alt=\"susc_tg_l\" width=\"180\" height=\"180\" srcset=\"https://reconnectearth.local/app/uploads/2019/02/susc_tg_l.jpg 180w, https://reconnectearth.local/app/uploads/2019/02/susc_tg_l-150x150.jpg 150w\" sizes=\"(max-width: 180px) 100vw, 180px\" />At the end of our walk we took time to write letters to our Washington state legislators, urging them to support proposed bills that would help protect the Salish Sea and the creatures who call it home from toxic pollutants, catastrophic oil spills, and other threats. By advancing important pieces of legislation this year, Washington&#8217;s lawmakers have a crucial opportunity to protect the Salish Sea ecosystem that includes Bellingham Bay.</p>\n<p>Saturday&#8217;s visit to the bay was Reconnect Earth&#8217;s first weekend trip in 2019, but it won&#8217;t be the last time we get outside this winter. See the full list of trips coming up here.</p>\n","featuredMedia":null,"categories":[{"id":"1","title":"Uncategorized","path":"/category/uncategorized"}],"tags":[]}},"context":{}}