{"data":{"wordPressPost":{"title":"Washington Youth Call on Sens Murray and Cantwell to Support the Green New Deal","content":"\n<div class=\"wp-block-image\"><figure class=\"alignleft size-large is-resized\"><img src=\"https://reconnectearth.local/app/uploads/2019/07/p1120687.jpg\" alt=\"\" class=\"wp-image-508\" width=\"466\" height=\"349\" srcset=\"https://reconnectearth.local/app/uploads/2019/07/p1120687.jpg 3264w, https://reconnectearth.local/app/uploads/2019/07/p1120687-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2019/07/p1120687-768x576.jpg 768w, https://reconnectearth.local/app/uploads/2019/07/p1120687-1024x768.jpg 1024w\" sizes=\"(max-width: 466px) 100vw, 466px\" /><figcaption>Students and supporters assemble before heading to Murray and Cantwell&#8217;s offices.</figcaption></figure></div>\n\n\n\n<p>Yesterday Reconnect Earth joined Sunrise Movement Seattle and other youth-led organizations at the offices of Washington&#8217;s U.S. senators, to call on them to support a Green New Deal to fight climate change. This action, organized by Seattle students, was the latest escalation in Sunrise Movement&#8217;s campaign to pressure Sens Patty Murray and Maria Cantwell to join twelve other senators and 94 members of the House of Representatives in supporting our best opportunity to confront the climate crisis head-on.</p>\n\n\n\n<p>Sunrise Movement Seattle has had many interactions with both Murray and Cantwell&#8217;s offices over the last several months&#8211;but despite claiming to be strong supporters of the environment, both senators have refused to take a stance on the Green New Deal. This puts them at odds with climate leaders including both of nearby Oregon&#8217;s U.S. senators and Seattle-area Congresswoman Pramila Jayapal. So yesterday, Sunrise and other youth organizations decided to increase the pressure.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft size-large is-resized\"><img src=\"https://reconnectearth.local/app/uploads/2019/07/p1120703.jpg\" alt=\"\" class=\"wp-image-509\" width=\"383\" height=\"286\" srcset=\"https://reconnectearth.local/app/uploads/2019/07/p1120703.jpg 3264w, https://reconnectearth.local/app/uploads/2019/07/p1120703-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2019/07/p1120703-768x576.jpg 768w, https://reconnectearth.local/app/uploads/2019/07/p1120703-1024x768.jpg 1024w\" sizes=\"(max-width: 383px) 100vw, 383px\" /></figure></div>\n\n\n\n<p>Around two dozen people met on the ground floor of the building out of which both senators conduct their Seattle field operations, before going over the plan together and taking an elevator up to first Murray and then Cantwell&#8217;s offices. At each office several young people who agreed to act as spokespeople delivered messages to staff in the small lobby area while most members of our group stood just outside the doors, flooding the hallway and holding signs and banners. At each office staff tried to get us to stop taking video&#8211;something organizers of the action felt was necessary to provide transparency and show how public officials are responding to calls to back the Green New Deal&#8211;and at some point building security was called. Despite this, participants in the action stayed peaceful and compassionate the whole time.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignright size-large is-resized\"><img src=\"https://reconnectearth.local/app/uploads/2019/07/p1120719.jpg\" alt=\"\" class=\"wp-image-510\" width=\"416\" height=\"311\" srcset=\"https://reconnectearth.local/app/uploads/2019/07/p1120719.jpg 3264w, https://reconnectearth.local/app/uploads/2019/07/p1120719-300x225.jpg 300w, https://reconnectearth.local/app/uploads/2019/07/p1120719-768x576.jpg 768w, https://reconnectearth.local/app/uploads/2019/07/p1120719-1024x768.jpg 1024w\" sizes=\"(max-width: 416px) 100vw, 416px\" /></figure></div>\n\n\n\n<p>Since Sens Murray and Cantwell still have not signed onto the Green New Deal there will no doubt be additional escalations in this campaign&#8211;and Reconnect Earth is excited to support Sunrise Movement in this crucial work. For yesterday&#8217;s action we helped spread the word and recruit folks to participate, and we stand ready to do so again next time. Youth are rising in Washington and throughout the country in response to the climate crisis, and there will be much more to come!</p>\n\n\n\n<p><strong><a href=\"https://www.facebook.com/SunriseWashington/videos/1562476530555144/\">Check out the video of the livestream from the action on Sunrise Movement Seattle&#8217;s Facebook page.</a></strong></p>\n\n\n\n<p></p>\n","featuredMedia":null,"categories":[{"id":"1","title":"Uncategorized","path":"/category/uncategorized"}],"tags":[]}},"context":{}}