{"data":{"wordPressCategory":{"title":"Uncategorized","belongsTo":{"pageInfo":{"totalPages":2,"currentPage":1},"edges":[{"node":{"id":"503","title":"Washington Youth Call on Sens Murray and Cantwell to Support the Green New Deal","path":"/2019/07/30/washington-youth-call-on-sens-murray-and-cantwell-to-support-the-green-new-deal","excerpt":"<p>Yesterday Reconnect Earth joined Sunrise Movement Seattle and other youth-led organizations at the offices of Washington&#8217;s U.S. senators, to call on them to support a Green New Deal to fight climate change. This action, organized by Seattle students, was the latest escalation in Sunrise Movement&#8217;s campaign to pressure Sens Patty Murray and Maria Cantwell to &hellip; <a href=\"https://reconnectearth.local/washington-youth-call-on-sens-murray-and-cantwell-to-support-the-green-new-deal/\">Continued</a></p>\n"}},{"node":{"id":"484","title":"Report From the Field: Reconnect Earth&#8217;s First Summer Backpacking Trip!","path":"/2019/07/04/report-from-the-field-reconnect-earths-first-summer-backpacking-trip","excerpt":"<p>From June 24th &#8211; July 1st, nine young people from three Northwest states (Washington, Oregon, and Montana) and two Reconnect Earth trip leaders spent eight days together in Mount Baker-Snoqualmie National Forest, learning about and discussing environmental issues, social justice, and grassroots activism. Along the way the group experienced some of the most spectacular landscapes &hellip; <a href=\"https://reconnectearth.local/report-from-the-field-reconnect-earths-first-summer-backpacking-trip/\">Continued</a></p>\n"}},{"node":{"id":"397","title":"A Conversation About Decolonizing","path":"/2019/03/13/a-conversation-about-decolonizing","excerpt":"<p>On March 10th Reconnect Earth led an event designed to spark conversations about decolonization and confronting the horrific history of colonialism in what is now Washington. This trip, called Decolonizing Bellingham&#8217;s Landscape, was part of our ongoing work to do environmental education in a new way that acknowledges and celebrates the history of Indigenous peoples &hellip; <a href=\"https://reconnectearth.local/a-conversation-about-decolonizing/\">Continued</a></p>\n"}},{"node":{"id":"370","title":"A Snowy Hike on Lookout Mountain","path":"/2019/02/26/a-snowy-hike-on-lookout-mountain","excerpt":"<p>On Saturday Reconnect Earth visited Lookout Mountain Preserve, a protected area in the northern Chuckanut Mountains. Though in Bellingham proper the snow from recent winter storms had almost disappeared, we arrived at the Lookout Mountain trail head to find a thick layer of snow still on the ground. We began hiking up the trail and &hellip; <a href=\"https://reconnectearth.local/a-snowy-hike-on-lookout-mountain/\">Continued</a></p>\n"}},{"node":{"id":"328","title":"Join Reconnect Earth in the North Cascades this Summer!","path":"/2019/02/11/join-reconnect-earth-in-the-north-cascades-this-summer","excerpt":"<p>Applications are now live for Reconnect Earth&#8217;s Summer 2019 trips, an unforgettable eight-day experience backpacking and camping in Washington&#8217;s North Cascades, while learning about ecology, human and natural history, and grassroots social change. On a summer trip you&#8217;ll hike through ancient forests, climb to alpine lakes, or look down onto glaciers during one of our trips &hellip; <a href=\"https://reconnectearth.local/join-reconnect-earth-in-the-north-cascades-this-summer/\">Continued</a></p>\n"}},{"node":{"id":"293","title":"Finding Marine Life on Bellingham Bay","path":"/2019/02/04/reconnect-earth-visits-bellingham-bay","excerpt":"<p>Reconnect Earth visited Bellingham&#8217;s Boulevard Park this Saturday for a walk following the edge of Bellingham Bay, during which we searched for marine invertebrates, birds, and other sea life. Seven of us explored the water&#8217;s edge and followed the over-water walkway to Fairhaven, stopping to observe any organisms we found along the way. Bellingham Bay &hellip; <a href=\"https://reconnectearth.local/reconnect-earth-visits-bellingham-bay/\">Continued</a></p>\n"}},{"node":{"id":"276","title":"Winter and Spring Trips are Open!","path":"/2019/01/07/winter-and-spring-trips-are-open","excerpt":"<p>Reconnect Earth is excited to announce our schedule of winter and spring trips for students is now available online! Sign up here to join us for a hike or other excursion focused on deepening our relationship with the landscape of Northwest Washington. This winter and spring Reconnect Earth will be leading hikes through the forests &hellip; <a href=\"https://reconnectearth.local/winter-and-spring-trips-are-open/\">Continued</a></p>\n"}},{"node":{"id":"226","title":"A Visit to the Nooksack River","path":"/2018/12/04/a-visit-to-the-nooksack-river","excerpt":"<p>This past Saturday, Reconnect Earth led a group of eight Western Washington University students on a hike at Hovander Homestead Park just west of Ferndale, WA, to experience and learn about life on the Nooksack River. Originating from snowpack high on the slopes of Mount Baker and Mount Shuksan in the North Cascades, the Nooksack &hellip; <a href=\"https://reconnectearth.local/a-visit-to-the-nooksack-river/\">Continued</a></p>\n"}},{"node":{"id":"210","title":"Finding Fall Salmon","path":"/2018/11/13/finding-fall-salmon","excerpt":"<p>The annual migration of adult salmon up streams and rivers throughout the Northwest to their natal spawning grounds is one of the most incredible phenomena in this region. This past Saturday Reconnect Earth visited Arroyo Park in Bellingham to search for migrating salmon swimming up Chuckanut Creek. And we found them! About twelve trip participants, &hellip; <a href=\"https://reconnectearth.local/finding-fall-salmon/\">Continued</a></p>\n"}},{"node":{"id":"199","title":"Reconnect Earth Visits the Chuckanuts","path":"/2018/10/23/reconnect-earth-visits-the-chuckanuts","excerpt":"<p>On Sunday, October 21st, a group of students from Western Washington University set out into the Chuckanut Mountains on Reconnect Earth&#8217;s first trip of the season. We started from the North Chuckanut Mountain Trailhead, just a short drive or bike ride from WWU and downtown Bellingham. It was a beautiful fall day with sunny weather &hellip; <a href=\"https://reconnectearth.local/reconnect-earth-visits-the-chuckanuts/\">Continued</a></p>\n"}}]}}},"context":{}}