{"data":{"wordPressPost":{"title":"Attend Reconnect Earth&#8217;s 2018 Student Organizing Camp!","content":"<p><img class=\"  wp-image-90 alignleft\" src=\"https://reconnectearth.local/app/uploads/2018/05/p1110802-2.jpg\" alt=\"P1110802 (2)\" width=\"379\" height=\"376\" srcset=\"https://reconnectearth.local/app/uploads/2018/05/p1110802-2.jpg 2466w, https://reconnectearth.local/app/uploads/2018/05/p1110802-2-150x150.jpg 150w, https://reconnectearth.local/app/uploads/2018/05/p1110802-2-300x298.jpg 300w, https://reconnectearth.local/app/uploads/2018/05/p1110802-2-768x762.jpg 768w, https://reconnectearth.local/app/uploads/2018/05/p1110802-2-1024x1017.jpg 1024w\" sizes=\"(max-width: 379px) 100vw, 379px\" />Are you a young person who wants to make the world a more ecologically sustainable, socially just place? Reconnect Earth&#8217;s first-ever Student Organizing Camp is now accepting applications. This event will take place at Washington&#8217;s Larrabee State Park* from <strong>Thursday, August 9th</strong> (starting in the late afternoon) through <strong>Sunday, August 12th</strong> (with the option to stay overnight until Monday morning). <strong><a href=\"https://goo.gl/forms/CAgmsF4xe35XZkUb2\">Apply now</a></strong> and join us for four days of building activist and grassroots organizing skills, exploring our identities as agents of change, and enjoying a truly beautiful section of the Washington Coast.</p>\n<p>At the Student Organizing Camp you&#8217;ll experience trainings and workshops on theories of social change, social identity, campaign planning, nonviolent activism, and more. Food is provided and some camping equipment is available for loan. This event is an opportunity to build your strengths and abilities as an agent of positive change while making connections with other youth activists in the region.</p>\n<p><strong><a href=\"https://goo.gl/forms/CAgmsF4xe35XZkUb2\">Apply to attend the Organizing Camp here. </a></strong></p>\n<p>Larrabee State Park is located on the Washington coast, a 15 minute drive or 40 minute bike ride from Downtown Bellingham. During the Organizing Camp we&#8217;ll have a chance to enjoy the beach and nearby trails including the 2-mile hike to Fragrance Lake.</p>\n<p>Reconnect Earth&#8217;s Student Organizing Camp is open to high school and college students and others who self-identify as &#8220;youth.&#8221; Participants under age 18 will need parental or guardian permission. Cost of registration is $30, with scholarships available to those for whom this represents a financial hardship. <strong><a href=\"https://goo.gl/forms/CAgmsF4xe35XZkUb2\">Apply here to attend.</a></strong></p>\n<p>&nbsp;</p>\n<p><em>*Larrabee State Park is on the traditional territory of Indigenous peoples including the Lummi Nation</em></p>\n","featuredMedia":null,"categories":[{"id":"1","title":"Uncategorized","path":"/category/uncategorized"}],"tags":[]}},"context":{}}