{"data":{"wordPressCategory":{"title":"Uncategorized","belongsTo":{"pageInfo":{"totalPages":2,"currentPage":2},"edges":[{"node":{"id":"191","title":"Fall Trips Are Open for Registration!","path":"/2018/10/01/fall-trips-are-open-for-registration","excerpt":"<p>This fall, Reconnect Earth is excited to announce we&#8217;re organizing four trips to some of the most beautiful places in and around Bellingham and Northwestern Washington. From weekend afternoon trips to places like the Chuckanut Mountains and Nooksack River, to a two-night Activist Training Retreat the last weekend in October, each of these events will &hellip; <a href=\"https://reconnectearth.local/fall-trips-are-open-for-registration/\">Continued</a></p>\n"}},{"node":{"id":"122","title":"A Summer of Movement and Community-Building","path":"/2018/08/29/a-summer-of-community-building","excerpt":"<p>Reconnect Earth&#8217;s first summer is drawing to a close, and it was a season full of community outreach and building ties with people and organizations throughout northwest Washington and beyond. In particular, Reconnect Earth has prioritized contributing to and having a presence at events organized by people at the frontlines of confronting social and environmental &hellip; <a href=\"https://reconnectearth.local/a-summer-of-community-building/\">Continued</a></p>\n"}},{"node":{"id":"104","title":"Reconnect Earth Supports Youth Mobilizing for Climate Action&#8211;Join Us!","path":"/2018/07/03/joinzerohour","excerpt":"<p>Something big is happening this month: Saturday, July 21st and the days leading up to it will mark the biggest youth of color-led mobilization for climate action in U.S. history. The Zero Hour movement was initiated by high school students in Seattle and has spread to become a nationwide uprising for just and equitable solutions &hellip; <a href=\"https://reconnectearth.local/joinzerohour/\">Continued</a></p>\n"}},{"node":{"id":"87","title":"Attend Reconnect Earth&#8217;s 2018 Student Organizing Camp!","path":"/2018/05/02/attend-reconnect-earths-2018-student-organizing-camp","excerpt":"<p>Are you a young person who wants to make the world a more ecologically sustainable, socially just place? Reconnect Earth&#8217;s first-ever Student Organizing Camp is now accepting applications. This event will take place at Washington&#8217;s Larrabee State Park* from Thursday, August 9th (starting in the late afternoon) through Sunday, August 12th (with the option to &hellip; <a href=\"https://reconnectearth.local/attend-reconnect-earths-2018-student-organizing-camp/\">Continued</a></p>\n"}},{"node":{"id":"512","title":"Reconnect Earth","path":"/2018/02/18/the-journey-begins","excerpt":"<p>Reconnect Earth works for a socially and ecologically just future by fostering and growing a network of empowered leaders who will sustain progressive movements for years to come. We work with emerging leaders who want to deepen their connection to ecosystems and communities and take action to create a better world. We believe the best &hellip; <a href=\"https://reconnectearth.local/the-journey-begins/\">Continued</a></p>\n"}}]}}},"context":{}}